const FIRST_NAMES = ["آرش", "کوروش", "سیاوش", "بابک", "داریوش", "سامان", "کامیار", "پرهام", "نیما", "ارسلان", "سارا", "نیکی", "رویا", "مهسا", "آیدا", "تینا", "نگار", "غزل", "پریسا", "هدیه", "امیر", "رضا", "محمد", "حمید", "سعید", "وحید", "مهدی", "علی", "حسین", "جواد", "آروین", "سپهر", "مانی", "رادین", "بردیا", "پارس", "کیان", "آرتین", "رایان", "هومن", "نسترن", "شادی", "الناز", "بهناز", "طناز", "یلدا", "ساغر", "ترانه", "مریم", "ناهید"];
const LAST_NAMES = ["رضایی", "حسینی", "محمدی", "احمدی", "کریمی", "موسوی", "جعفری", "قاسمی", "عباسی", "نوری", "مرادی", "زارع", "نادری", "فلاح", "امیری", "سلطانی", "نظری", "باقری", "صادقی", "پور", "منش", "زاده"];

export function generateNames() {
    const list = [];
    for (let f of FIRST_NAMES) {
        for (let l of LAST_NAMES) {
            list.push(`${f} ${l}`);
        }
    }
    // Shuffle
    for (let i = list.length - 1; i > 0; i--) {
        const j = Math.floor(Math.random() * (i + 1));
        [list[i], list[j]] = [list[j], list[i]];
    }
    return list;
}